Src/OpenFOAM/OpenFOAM-5.x-master/tutorials/multiphase/interFoam/laminar/damBreak/damBreak/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication setFields
runApplication $application

#------------------------------------------------------------------------------
